/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar_fd.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: silee <silee@student.42seoul.kr>           +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/11/20 18:49:24 by silee             #+#    #+#             */
/*   Updated: 2021/11/29 16:17:51 by silee            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
void	ft_putchar_fd(char c, int fd)
{
	// Q. fd음수처리를 안한 이유?
	// A. write 안에서 음수처리가 자동으로 되기때문에 고려하지 않아도 된다
	// fd가 음수값이면 무시되거나 에러가 발생하는데 write 에서 fd가 음수면 return이 되기때문에 처리를 안해도 된다.
	write (fd, &c, 1);
}
